In [38]:
import pandas as pd
import numpy as np

In [39]:
df1=pd.read_csv("C:\\Users\\Hello\\Desktop\\Dataset\\weight-height.csv")

In [40]:
df1

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [41]:
df1.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [42]:
df1.columns

Index(['Gender', 'Height', 'Weight'], dtype='object')

In [43]:
df1.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989698

In [44]:
m=df1["Height"].mean()

In [45]:
m

66.3675597548656

In [46]:
m=np.round(m)

In [47]:
m

66.0

In [48]:
sd=df1["Height"].std()

In [49]:
sd=np.round(sd)

In [50]:
sd

4.0

In [51]:
low=m-(3*sd)

In [52]:
low

54.0

In [53]:
high=m+(3*sd)

In [54]:
high

78.0

In [55]:
df1[(df1["Height"]<low)|(df1["Height"]>high)]

     Gender     Height      Weight
994    Male  78.095867  255.690835
1317   Male  78.462053  227.342565
2014   Male  78.998742  269.989698
3285   Male  78.528210  253.889004
3757   Male  78.621374  245.733783

In [56]:
df1["Height"]=df1["Height"].apply(lambda x:low if x<low else high if x>high else x)

In [57]:
df1[(df1["Height"]<low)|(df1["Height"]>high)]

Empty DataFrame
Columns: [Gender, Height, Weight]
Index: []

In [60]:
from sklearn.preprocessing import OneHotEncoder

In [90]:
ohe=OneHotEncoder(drop="first")

In [91]:
ohe

OneHotEncoder(drop='first')

In [92]:
ohe.fit(df1[["Gender"]])

OneHotEncoder(drop='first')

In [93]:
ary1=ohe.transform(df1[["Gender"]]).toarray()

In [94]:
ary1

array([[1.],
       [1.],
       [1.],
       ...,
       [0.],
       [0.],
       [0.]])

In [95]:
ohe.categories_

[array(['Female', 'Male'], dtype=object)]

In [97]:
dfmale=pd.DataFrame(ary1,columns=["Male"],dtype=int)

In [99]:
df1

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [100]:
dfmale

      Male
0        1
1        1
2        1
3        1
4        1
...    ...
9995     0
9996     0
9997     0
9998     0
9999     0

[10000 rows x 1 columns]

In [102]:
df1=pd.concat([df1,dfmale],axis=1).drop("Gender",axis=1)

In [103]:
df1

         Height      Weight  Male
0     73.847017  241.893563     1
1     68.781904  162.310473     1
2     74.110105  212.740856     1
3     71.730978  220.042470     1
4     69.881796  206.349801     1
...         ...         ...   ...
9995  66.172652  136.777454     0
9996  67.067155  170.867906     0
9997  63.867992  128.475319     0
9998  69.034243  163.852461     0
9999  61.944246  113.649103     0

[10000 rows x 3 columns]

In [104]:
df1.head()

      Height      Weight  Male
0  73.847017  241.893563     1
1  68.781904  162.310473     1
2  74.110105  212.740856     1
3  71.730978  220.042470     1
4  69.881796  206.349801     1

In [106]:
X=df1.drop("Weight",axis=1)

In [110]:
X

         Height  Male
0     73.847017     1
1     68.781904     1
2     74.110105     1
3     71.730978     1
4     69.881796     1
...         ...   ...
9995  66.172652     0
9996  67.067155     0
9997  63.867992     0
9998  69.034243     0
9999  61.944246     0

[10000 rows x 2 columns]

In [111]:
y=df1["Weight"]

In [112]:
y

0       241.893563
1       162.310473
2       212.740856
3       220.042470
4       206.349801
           ...
9995    136.777454
9996    170.867906
9997    128.475319
9998    163.852461
9999    113.649103
Name: Weight, Length: 10000, dtype: float64

In [113]:
##splitting of data using train,test split

In [114]:
from sklearn.model_selection import train_test_split

In [116]:
Xtrain,Xtest,ytrain,ytest=train_test_split(X,y, test_size=0.20)

In [117]:
Xtrain.shape

(8000, 2)

In [118]:
Xtest.shape

(2000, 2)

In [121]:
X.shape

(10000, 2)

In [122]:
ytrain.shape

(8000,)

In [123]:
ytest.shape

(2000,)

In [124]:
y.shape

(10000,)

In [125]:
## MODEL BUILDING--LINEAR REGRESSION

In [128]:
from sklearn.linear_model import LinearRegression

In [130]:
lreg=LinearRegression()

In [131]:
lreg

LinearRegression()

In [132]:
lreg.fit(Xtrain,ytrain)

LinearRegression()

In [133]:
lreg.coef_

array([ 5.99189927, 19.30967667])

In [134]:
lreg.intercept_

-245.9486962702246

In [135]:
lreg.score(Xtest,ytest)

0.8957659458324738

In [138]:
ypredict=lreg.predict(Xtrain)

In [139]:
ytrain

2608    207.710757
9867    151.492031
6346    116.902771
1547    207.243854
2849    158.715870
           ...
871     201.842809
7725    138.190283
2010    186.550233
1363    175.040665
9654    135.633470
Name: Weight, Length: 8000, dtype: float64

In [140]:
from sklearn import metrics

In [141]:
metrics.r2_score(ytrain,ypredict)

0.9043412532254245

In [142]:
metrics.mean_absolute_error(ytrain,ypredict)

7.960011135494593

In [143]:
metrics.mean_squared_error(ytrain,ypredict)

99.32762656889305